In [1]:
names=["Tomás", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

In [2]:
data={'names':names, 'woman':woman, 'ages':ages, 'country':country, 'education':education}

In [3]:
from pandas import DataFrame as df # calling a function from the library and renaming the function name

friends=df.from_dict(data)
friends

   ages  country education    names  woman
0    32    Chile      Bach    Tomás  False
1    33  Senegal      Bach  Pauline   True
2    28    Spain    Master    Pablo  False
3    30   Norway       PhD    Bjork  False
4    32     Peru      Bach     Alan  False
5    27     Peru    Master    Juana   True

In [28]:
# where is the youngest male in the group from?

# Find the answer using sort_values()
friends[friends.woman==False].sort_values('ages', ascending=True).head(1).country

2    Spain
Name: country, dtype: object

In [44]:
# Do some research and find the answer using where() and min()
import pandas as pd

a = min(friends.where(friends.woman==False).ages)
friends[ages==a].country

2    Spain
Name: country, dtype: object

In [51]:
# Do some research and find the answer using query() and min()

a = min(friends.query('woman==False').ages)
friends[ages==a].country

2    Spain
Name: country, dtype: object